{
    "[UNK]": 0,
    "[EOS]": 1,
    "[BOS]": 2,
    "[CLS]": 3,
    "[SEP]": 4,
    "[PAD]": 5,
    "[MASK]": 6,
    "[HIST]": 7,
    "[PITCH]": 8,
    "[INST]": 9,
    "[MELODY]": 10,
    "[CHORD]": 11,
    "b-1": 12,
    "o-0": 13,
    "o-1": 14,
    "o-2": 15,
    "o-3": 16,
    "o-4": 17,
    "o-5": 18,
    "o-6": 19,
    "o-7": 20,
    "o-8": 21,
    "o-9": 22,
    "o-10": 23,
    "o-11": 24,
    "o-12": 25,
    "o-13": 26,
    "o-14": 27,
    "o-15": 28,
    "o-16": 29,
    "o-17": 30,
    "o-18": 31,
    "o-19": 32,
    "o-20": 33,
    "o-21": 34,
    "o-22": 35,
    "o-23": 36,
    "o-24": 37,
    "o-25": 38,
    "o-26": 39,
    "o-27": 40,
    "o-28": 41,
    "o-29": 42,
    "o-30": 43,
    "o-31": 44,
    "o-32": 45,
    "o-33": 46,
    "o-34": 47,
    "o-35": 48,
    "o-36": 49,
    "o-37": 50,
    "o-38": 51,
    "o-39": 52,
    "o-40": 53,
    "o-41": 54,
    "o-42": 55,
    "o-43": 56,
    "o-44": 57,
    "o-45": 58,
    "o-46": 59,
    "o-47": 60,
    "o-48": 61,
    "o-49": 62,
    "o-50": 63,
    "o-51": 64,
    "o-52": 65,
    "o-53": 66,
    "o-54": 67,
    "o-55": 68,
    "o-56": 69,
    "o-57": 70,
    "o-58": 71,
    "o-59": 72,
    "o-60": 73,
    "o-61": 74,
    "o-62": 75,
    "o-63": 76,
    "o-64": 77,
    "o-65": 78,
    "o-66": 79,
    "o-67": 80,
    "o-68": 81,
    "o-69": 82,
    "o-70": 83,
    "o-71": 84,
    "o-72": 85,
    "o-73": 86,
    "o-74": 87,
    "o-75": 88,
    "o-76": 89,
    "o-77": 90,
    "o-78": 91,
    "o-79": 92,
    "o-80": 93,
    "o-81": 94,
    "o-82": 95,
    "o-83": 96,
    "o-84": 97,
    "o-85": 98,
    "o-86": 99,
    "o-87": 100,
    "o-88": 101,
    "o-89": 102,
    "o-90": 103,
    "o-91": 104,
    "o-92": 105,
    "o-93": 106,
    "o-94": 107,
    "o-95": 108,
    "o-96": 109,
    "o-97": 110,
    "o-98": 111,
    "o-99": 112,
    "o-100": 113,
    "o-101": 114,
    "o-102": 115,
    "o-103": 116,
    "o-104": 117,
    "o-105": 118,
    "o-106": 119,
    "o-107": 120,
    "o-108": 121,
    "o-109": 122,
    "o-110": 123,
    "o-111": 124,
    "o-112": 125,
    "o-113": 126,
    "o-114": 127,
    "o-115": 128,
    "o-116": 129,
    "o-117": 130,
    "o-118": 131,
    "o-119": 132,
    "o-120": 133,
    "o-121": 134,
    "o-122": 135,
    "o-123": 136,
    "o-124": 137,
    "o-125": 138,
    "o-126": 139,
    "o-127": 140,
    "i-0": 141,
    "i-1": 142,
    "i-2": 143,
    "i-3": 144,
    "i-4": 145,
    "i-5": 146,
    "i-6": 147,
    "i-7": 148,
    "i-8": 149,
    "i-9": 150,
    "i-10": 151,
    "i-11": 152,
    "i-12": 153,
    "i-13": 154,
    "i-14": 155,
    "i-15": 156,
    "i-16": 157,
    "i-17": 158,
    "i-18": 159,
    "i-19": 160,
    "i-20": 161,
    "i-21": 162,
    "i-22": 163,
    "i-23": 164,
    "i-24": 165,
    "i-25": 166,
    "i-26": 167,
    "i-27": 168,
    "i-28": 169,
    "i-29": 170,
    "i-30": 171,
    "i-31": 172,
    "i-32": 173,
    "i-33": 174,
    "i-34": 175,
    "i-35": 176,
    "i-36": 177,
    "i-37": 178,
    "i-38": 179,
    "i-39": 180,
    "i-40": 181,
    "i-41": 182,
    "i-42": 183,
    "i-43": 184,
    "i-44": 185,
    "i-45": 186,
    "i-46": 187,
    "i-47": 188,
    "i-48": 189,
    "i-49": 190,
    "i-50": 191,
    "i-51": 192,
    "i-52": 193,
    "i-53": 194,
    "i-54": 195,
    "i-55": 196,
    "i-56": 197,
    "i-57": 198,
    "i-58": 199,
    "i-59": 200,
    "i-60": 201,
    "i-61": 202,
    "i-62": 203,
    "i-63": 204,
    "i-64": 205,
    "i-65": 206,
    "i-66": 207,
    "i-67": 208,
    "i-68": 209,
    "i-69": 210,
    "i-70": 211,
    "i-71": 212,
    "i-72": 213,
    "i-73": 214,
    "i-74": 215,
    "i-75": 216,
    "i-76": 217,
    "i-77": 218,
    "i-78": 219,
    "i-79": 220,
    "i-80": 221,
    "i-81": 222,
    "i-82": 223,
    "i-83": 224,
    "i-84": 225,
    "i-85": 226,
    "i-86": 227,
    "i-87": 228,
    "i-88": 229,
    "i-89": 230,
    "i-90": 231,
    "i-91": 232,
    "i-92": 233,
    "i-93": 234,
    "i-94": 235,
    "i-95": 236,
    "i-96": 237,
    "i-97": 238,
    "i-98": 239,
    "i-99": 240,
    "i-100": 241,
    "i-101": 242,
    "i-102": 243,
    "i-103": 244,
    "i-104": 245,
    "i-105": 246,
    "i-106": 247,
    "i-107": 248,
    "i-108": 249,
    "i-109": 250,
    "i-110": 251,
    "i-111": 252,
    "i-112": 253,
    "i-113": 254,
    "i-114": 255,
    "i-115": 256,
    "i-116": 257,
    "i-117": 258,
    "i-118": 259,
    "i-119": 260,
    "i-120": 261,
    "i-121": 262,
    "i-122": 263,
    "i-123": 264,
    "i-124": 265,
    "i-125": 266,
    "i-126": 267,
    "i-127": 268,
    "i-128": 269,
    "p-0": 270,
    "p-1": 271,
    "p-2": 272,
    "p-3": 273,
    "p-4": 274,
    "p-5": 275,
    "p-6": 276,
    "p-7": 277,
    "p-8": 278,
    "p-9": 279,
    "p-10": 280,
    "p-11": 281,
    "p-12": 282,
    "p-13": 283,
    "p-14": 284,
    "p-15": 285,
    "p-16": 286,
    "p-17": 287,
    "p-18": 288,
    "p-19": 289,
    "p-20": 290,
    "p-21": 291,
    "p-22": 292,
    "p-23": 293,
    "p-24": 294,
    "p-25": 295,
    "p-26": 296,
    "p-27": 297,
    "p-28": 298,
    "p-29": 299,
    "p-30": 300,
    "p-31": 301,
    "p-32": 302,
    "p-33": 303,
    "p-34": 304,
    "p-35": 305,
    "p-36": 306,
    "p-37": 307,
    "p-38": 308,
    "p-39": 309,
    "p-40": 310,
    "p-41": 311,
    "p-42": 312,
    "p-43": 313,
    "p-44": 314,
    "p-45": 315,
    "p-46": 316,
    "p-47": 317,
    "p-48": 318,
    "p-49": 319,
    "p-50": 320,
    "p-51": 321,
    "p-52": 322,
    "p-53": 323,
    "p-54": 324,
    "p-55": 325,
    "p-56": 326,
    "p-57": 327,
    "p-58": 328,
    "p-59": 329,
    "p-60": 330,
    "p-61": 331,
    "p-62": 332,
    "p-63": 333,
    "p-64": 334,
    "p-65": 335,
    "p-66": 336,
    "p-67": 337,
    "p-68": 338,
    "p-69": 339,
    "p-70": 340,
    "p-71": 341,
    "p-72": 342,
    "p-73": 343,
    "p-74": 344,
    "p-75": 345,
    "p-76": 346,
    "p-77": 347,
    "p-78": 348,
    "p-79": 349,
    "p-80": 350,
    "p-81": 351,
    "p-82": 352,
    "p-83": 353,
    "p-84": 354,
    "p-85": 355,
    "p-86": 356,
    "p-87": 357,
    "p-88": 358,
    "p-89": 359,
    "p-90": 360,
    "p-91": 361,
    "p-92": 362,
    "p-93": 363,
    "p-94": 364,
    "p-95": 365,
    "p-96": 366,
    "p-97": 367,
    "p-98": 368,
    "p-99": 369,
    "p-100": 370,
    "p-101": 371,
    "p-102": 372,
    "p-103": 373,
    "p-104": 374,
    "p-105": 375,
    "p-106": 376,
    "p-107": 377,
    "p-108": 378,
    "p-109": 379,
    "p-110": 380,
    "p-111": 381,
    "p-112": 382,
    "p-113": 383,
    "p-114": 384,
    "p-115": 385,
    "p-116": 386,
    "p-117": 387,
    "p-118": 388,
    "p-119": 389,
    "p-120": 390,
    "p-121": 391,
    "p-122": 392,
    "p-123": 393,
    "p-124": 394,
    "p-125": 395,
    "p-126": 396,
    "p-127": 397,
    "p-128": 398,
    "p-129": 399,
    "p-130": 400,
    "p-131": 401,
    "p-132": 402,
    "p-133": 403,
    "p-134": 404,
    "p-135": 405,
    "p-136": 406,
    "p-137": 407,
    "p-138": 408,
    "p-139": 409,
    "p-140": 410,
    "p-141": 411,
    "p-142": 412,
    "p-143": 413,
    "p-144": 414,
    "p-145": 415,
    "p-146": 416,
    "p-147": 417,
    "p-148": 418,
    "p-149": 419,
    "p-150": 420,
    "p-151": 421,
    "p-152": 422,
    "p-153": 423,
    "p-154": 424,
    "p-155": 425,
    "p-156": 426,
    "p-157": 427,
    "p-158": 428,
    "p-159": 429,
    "p-160": 430,
    "p-161": 431,
    "p-162": 432,
    "p-163": 433,
    "p-164": 434,
    "p-165": 435,
    "p-166": 436,
    "p-167": 437,
    "p-168": 438,
    "p-169": 439,
    "p-170": 440,
    "p-171": 441,
    "p-172": 442,
    "p-173": 443,
    "p-174": 444,
    "p-175": 445,
    "p-176": 446,
    "p-177": 447,
    "p-178": 448,
    "p-179": 449,
    "p-180": 450,
    "p-181": 451,
    "p-182": 452,
    "p-183": 453,
    "p-184": 454,
    "p-185": 455,
    "p-186": 456,
    "p-187": 457,
    "p-188": 458,
    "p-189": 459,
    "p-190": 460,
    "p-191": 461,
    "p-192": 462,
    "p-193": 463,
    "p-194": 464,
    "p-195": 465,
    "p-196": 466,
    "p-197": 467,
    "p-198": 468,
    "p-199": 469,
    "p-200": 470,
    "p-201": 471,
    "p-202": 472,
    "p-203": 473,
    "p-204": 474,
    "p-205": 475,
    "p-206": 476,
    "p-207": 477,
    "p-208": 478,
    "p-209": 479,
    "p-210": 480,
    "p-211": 481,
    "p-212": 482,
    "p-213": 483,
    "p-214": 484,
    "p-215": 485,
    "p-216": 486,
    "p-217": 487,
    "p-218": 488,
    "p-219": 489,
    "p-220": 490,
    "p-221": 491,
    "p-222": 492,
    "p-223": 493,
    "p-224": 494,
    "p-225": 495,
    "p-226": 496,
    "p-227": 497,
    "p-228": 498,
    "p-229": 499,
    "p-230": 500,
    "p-231": 501,
    "p-232": 502,
    "p-233": 503,
    "p-234": 504,
    "p-235": 505,
    "p-236": 506,
    "p-237": 507,
    "p-238": 508,
    "p-239": 509,
    "p-240": 510,
    "p-241": 511,
    "p-242": 512,
    "p-243": 513,
    "p-244": 514,
    "p-245": 515,
    "p-246": 516,
    "p-247": 517,
    "p-248": 518,
    "p-249": 519,
    "p-250": 520,
    "p-251": 521,
    "p-252": 522,
    "p-253": 523,
    "p-254": 524,
    "p-255": 525,
    "d-0": 526,
    "d-1": 527,
    "d-2": 528,
    "d-3": 529,
    "d-4": 530,
    "d-5": 531,
    "d-6": 532,
    "d-7": 533,
    "d-8": 534,
    "d-9": 535,
    "d-10": 536,
    "d-11": 537,
    "d-12": 538,
    "d-13": 539,
    "d-14": 540,
    "d-15": 541,
    "d-16": 542,
    "d-17": 543,
    "d-18": 544,
    "d-19": 545,
    "d-20": 546,
    "d-21": 547,
    "d-22": 548,
    "d-23": 549,
    "d-24": 550,
    "d-25": 551,
    "d-26": 552,
    "d-27": 553,
    "d-28": 554,
    "d-29": 555,
    "d-30": 556,
    "d-31": 557,
    "d-32": 558,
    "d-33": 559,
    "d-34": 560,
    "d-35": 561,
    "d-36": 562,
    "d-37": 563,
    "d-38": 564,
    "d-39": 565,
    "d-40": 566,
    "d-41": 567,
    "d-42": 568,
    "d-43": 569,
    "d-44": 570,
    "d-45": 571,
    "d-46": 572,
    "d-47": 573,
    "d-48": 574,
    "d-49": 575,
    "d-50": 576,
    "d-51": 577,
    "d-52": 578,
    "d-53": 579,
    "d-54": 580,
    "d-55": 581,
    "d-56": 582,
    "d-57": 583,
    "d-58": 584,
    "d-59": 585,
    "d-60": 586,
    "d-61": 587,
    "d-62": 588,
    "d-63": 589,
    "d-64": 590,
    "d-65": 591,
    "d-66": 592,
    "d-67": 593,
    "d-68": 594,
    "d-69": 595,
    "d-70": 596,
    "d-71": 597,
    "d-72": 598,
    "d-73": 599,
    "d-74": 600,
    "d-75": 601,
    "d-76": 602,
    "d-77": 603,
    "d-78": 604,
    "d-79": 605,
    "d-80": 606,
    "d-81": 607,
    "d-82": 608,
    "d-83": 609,
    "d-84": 610,
    "d-85": 611,
    "d-86": 612,
    "d-87": 613,
    "d-88": 614,
    "d-89": 615,
    "d-90": 616,
    "d-91": 617,
    "d-92": 618,
    "d-93": 619,
    "d-94": 620,
    "d-95": 621,
    "d-96": 622,
    "d-97": 623,
    "d-98": 624,
    "d-99": 625,
    "d-100": 626,
    "d-101": 627,
    "d-102": 628,
    "d-103": 629,
    "d-104": 630,
    "d-105": 631,
    "d-106": 632,
    "d-107": 633,
    "d-108": 634,
    "d-109": 635,
    "d-110": 636,
    "d-111": 637,
    "d-112": 638,
    "d-113": 639,
    "d-114": 640,
    "d-115": 641,
    "d-116": 642,
    "d-117": 643,
    "d-118": 644,
    "d-119": 645,
    "d-120": 646,
    "d-121": 647,
    "d-122": 648,
    "d-123": 649,
    "d-124": 650,
    "d-125": 651,
    "d-126": 652,
    "d-127": 653,
    "v-0": 654,
    "v-1": 655,
    "v-2": 656,
    "v-3": 657,
    "v-4": 658,
    "v-5": 659,
    "v-6": 660,
    "v-7": 661,
    "v-8": 662,
    "v-9": 663,
    "v-10": 664,
    "v-11": 665,
    "v-12": 666,
    "v-13": 667,
    "v-14": 668,
    "v-15": 669,
    "v-16": 670,
    "v-17": 671,
    "v-18": 672,
    "v-19": 673,
    "v-20": 674,
    "v-21": 675,
    "v-22": 676,
    "v-23": 677,
    "v-24": 678,
    "v-25": 679,
    "v-26": 680,
    "v-27": 681,
    "v-28": 682,
    "v-29": 683,
    "v-30": 684,
    "v-31": 685,
    "s-0": 686,
    "s-1": 687,
    "s-2": 688,
    "s-3": 689,
    "s-4": 690,
    "s-5": 691,
    "s-6": 692,
    "s-7": 693,
    "s-8": 694,
    "s-9": 695,
    "s-10": 696,
    "s-11": 697,
    "s-12": 698,
    "s-13": 699,
    "s-14": 700,
    "s-15": 701,
    "s-16": 702,
    "s-17": 703,
    "s-18": 704,
    "s-19": 705,
    "s-20": 706,
    "s-21": 707,
    "s-22": 708,
    "s-23": 709,
    "s-24": 710,
    "s-25": 711,
    "s-26": 712,
    "s-27": 713,
    "s-28": 714,
    "s-29": 715,
    "s-30": 716,
    "s-31": 717,
    "s-32": 718,
    "s-33": 719,
    "s-34": 720,
    "s-35": 721,
    "s-36": 722,
    "s-37": 723,
    "s-38": 724,
    "s-39": 725,
    "s-40": 726,
    "s-41": 727,
    "s-42": 728,
    "s-43": 729,
    "s-44": 730,
    "s-45": 731,
    "s-46": 732,
    "s-47": 733,
    "s-48": 734,
    "s-49": 735,
    "s-50": 736,
    "s-51": 737,
    "s-52": 738,
    "s-53": 739,
    "s-54": 740,
    "s-55": 741,
    "s-56": 742,
    "s-57": 743,
    "s-58": 744,
    "s-59": 745,
    "s-60": 746,
    "s-61": 747,
    "s-62": 748,
    "s-63": 749,
    "s-64": 750,
    "s-65": 751,
    "s-66": 752,
    "s-67": 753,
    "s-68": 754,
    "s-69": 755,
    "s-70": 756,
    "s-71": 757,
    "s-72": 758,
    "s-73": 759,
    "s-74": 760,
    "s-75": 761,
    "s-76": 762,
    "s-77": 763,
    "s-78": 764,
    "s-79": 765,
    "s-80": 766,
    "s-81": 767,
    "s-82": 768,
    "s-83": 769,
    "s-84": 770,
    "s-85": 771,
    "s-86": 772,
    "s-87": 773,
    "s-88": 774,
    "s-89": 775,
    "s-90": 776,
    "s-91": 777,
    "s-92": 778,
    "s-93": 779,
    "s-94": 780,
    "s-95": 781,
    "s-96": 782,
    "s-97": 783,
    "s-98": 784,
    "s-99": 785,
    "s-100": 786,
    "s-101": 787,
    "s-102": 788,
    "s-103": 789,
    "s-104": 790,
    "s-105": 791,
    "s-106": 792,
    "s-107": 793,
    "s-108": 794,
    "s-109": 795,
    "s-110": 796,
    "s-111": 797,
    "s-112": 798,
    "s-113": 799,
    "s-114": 800,
    "s-115": 801,
    "s-116": 802,
    "s-117": 803,
    "s-118": 804,
    "s-119": 805,
    "s-120": 806,
    "s-121": 807,
    "s-122": 808,
    "s-123": 809,
    "s-124": 810,
    "s-125": 811,
    "s-126": 812,
    "s-127": 813,
    "s-128": 814,
    "s-129": 815,
    "s-130": 816,
    "s-131": 817,
    "s-132": 818,
    "s-133": 819,
    "s-134": 820,
    "s-135": 821,
    "s-136": 822,
    "s-137": 823,
    "s-138": 824,
    "s-139": 825,
    "s-140": 826,
    "s-141": 827,
    "s-142": 828,
    "s-143": 829,
    "s-144": 830,
    "s-145": 831,
    "s-146": 832,
    "s-147": 833,
    "s-148": 834,
    "s-149": 835,
    "s-150": 836,
    "s-151": 837,
    "s-152": 838,
    "s-153": 839,
    "s-154": 840,
    "s-155": 841,
    "s-156": 842,
    "s-157": 843,
    "s-158": 844,
    "s-159": 845,
    "s-160": 846,
    "s-161": 847,
    "s-162": 848,
    "s-163": 849,
    "s-164": 850,
    "s-165": 851,
    "s-166": 852,
    "s-167": 853,
    "s-168": 854,
    "s-169": 855,
    "s-170": 856,
    "s-171": 857,
    "s-172": 858,
    "s-173": 859,
    "s-174": 860,
    "s-175": 861,
    "s-176": 862,
    "s-177": 863,
    "s-178": 864,
    "s-179": 865,
    "s-180": 866,
    "s-181": 867,
    "s-182": 868,
    "s-183": 869,
    "s-184": 870,
    "s-185": 871,
    "s-186": 872,
    "s-187": 873,
    "s-188": 874,
    "s-189": 875,
    "s-190": 876,
    "s-191": 877,
    "s-192": 878,
    "s-193": 879,
    "s-194": 880,
    "s-195": 881,
    "s-196": 882,
    "s-197": 883,
    "s-198": 884,
    "s-199": 885,
    "s-200": 886,
    "s-201": 887,
    "s-202": 888,
    "s-203": 889,
    "s-204": 890,
    "s-205": 891,
    "s-206": 892,
    "s-207": 893,
    "s-208": 894,
    "s-209": 895,
    "s-210": 896,
    "s-211": 897,
    "s-212": 898,
    "s-213": 899,
    "s-214": 900,
    "s-215": 901,
    "s-216": 902,
    "s-217": 903,
    "s-218": 904,
    "s-219": 905,
    "s-220": 906,
    "s-221": 907,
    "s-222": 908,
    "s-223": 909,
    "s-224": 910,
    "s-225": 911,
    "s-226": 912,
    "s-227": 913,
    "s-228": 914,
    "s-229": 915,
    "s-230": 916,
    "s-231": 917,
    "s-232": 918,
    "s-233": 919,
    "s-234": 920,
    "s-235": 921,
    "s-236": 922,
    "s-237": 923,
    "s-238": 924,
    "s-239": 925,
    "s-240": 926,
    "s-241": 927,
    "s-242": 928,
    "s-243": 929,
    "s-244": 930,
    "s-245": 931,
    "s-246": 932,
    "s-247": 933,
    "s-248": 934,
    "s-249": 935,
    "s-250": 936,
    "s-251": 937,
    "s-252": 938,
    "s-253": 939,
    "t-0": 940,
    "t-1": 941,
    "t-2": 942,
    "t-3": 943,
    "t-4": 944,
    "t-5": 945,
    "t-6": 946,
    "t-7": 947,
    "t-8": 948,
    "t-9": 949,
    "t-10": 950,
    "t-11": 951,
    "t-12": 952,
    "t-13": 953,
    "t-14": 954,
    "t-15": 955,
    "t-16": 956,
    "t-17": 957,
    "t-18": 958,
    "t-19": 959,
    "t-20": 960,
    "t-21": 961,
    "t-22": 962,
    "t-23": 963,
    "t-24": 964,
    "t-25": 965,
    "t-26": 966,
    "t-27": 967,
    "t-28": 968,
    "t-29": 969,
    "t-30": 970,
    "t-31": 971,
    "t-32": 972,
    "t-33": 973,
    "t-34": 974,
    "t-35": 975,
    "t-36": 976,
    "t-37": 977,
    "t-38": 978,
    "t-39": 979,
    "t-40": 980,
    "t-41": 981,
    "t-42": 982,
    "t-43": 983,
    "t-44": 984,
    "t-45": 985,
    "t-46": 986,
    "t-47": 987,
    "t-48": 988
}